# 2. Добавление, удаление, редактирование данных

SQL = Structured Query Language

[MySQL](https://www.mysqltutorial.org/mysql-having.aspx/): `FROM` => `WHERE` = `SELECT` = `GROUP BY` = `HAVING` = `ORDER BY` = `LIMIT`.   

[PostgreSQL](https://www.postgresqltutorial.com/postgresql-having/): `FROM` => `WHERE` = `GROUP BY` = `HAVING` = `SELECT` = `DISTINCT` = `ORDER BY` = `LIMIT`.

Структура:

```MySQL
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
HAVING condition
ORDER BY column_name(s);
LIMIT number of tuples;
```

На примере таблицы **Сотрудник** рассмотрим терминологию реляционных баз данных:

- **Relation** (*Отношение*) – это структура данных целиком, набор записей (в обычном понимании – **таблица**) , в  примере – это `Сотрудник`;
- **Tuple** (*Кортеж*) – это каждая строка, содержащая данные (более распространенный термин – **запись**), например, `<001, Борин С.А, 234-01-23, программист>`, все кортежи в отношении должны быть различны;
- **Мощность** – число кортежей в таблице (проще говоря, **число записей**), в данном случае 3, мощность отношения может быть любой (от 0 до бесконечности), порядок следования кортежей - неважен;
- **Attribute / Field**  (*Атрибут*) – это столбец в таблице (более распространенный термин – *поле*), в примере – `Табельный номер`, `Фамилия И.О.`, `Телефон`, `Должность`); 
- **Dimension** (*Размерность*) – это число атрибутов в таблице, в данном случае – 4; размерность отношения должна быть больше 0, порядок следования атрибутов существенен;
- **Domain** (*Домен атрибута*) – это допустимые значения (неповторяющиеся), которые можно занести в поле , например для атрибута `Должность` домен – `{инженер, программист}`.

# 2.1 Добавление данных

Добавьте в таблицу **orders** данные о новом заказе стоимостью 3000 рублей. В заказе 3 товара (**products**).

```MySQL
INSERT INTO orders (id, products, sum)
VALUES (6, 3, 3000);
```

Добавьте в таблицу **products** новый товар — «Xbox», стоимостью 30000 рублей в количестве (**count**) трех штук.

```MySQL
INSERT INTO products (id, name,	count, price)
VALUES (7, 'Xbox', 3, 30000);
```

Добавьте в таблицу **products** новый товар — «iMac 21», стоимостью 100100 рублей. Товар пока не завезли на склад.

```MySQL
INSERT INTO products (id, name,	count, price)
VALUES (8, 'iMac 21', 0, 100100);
```

Добавьте в таблицу **users** нового пользователя Антона Пепеляева с датой рождения 12 июля 1992 года

```MySQL
INSERT INTO users (id, first_name, last_name, birthday)
VALUES (9, 'Антон', 'Пепеляев', '1992-07-12');
```

Добавьте в таблицу **users** нового пользователя Никиту Петрова. Дату рождения не указывайте. Используйте ключевое слово SET.

```MySQL
INSERT INTO users
SET id = 10, first_name = 'Никита', last_name = 'Петров';
```

Добавьте одним SQL запросом в таблицу products следующие товары:
* iPhone 7, цена 59990, 1 шт.
* iPhone 8, цена 64990, 3 шт.
* iPhone X, цена 79900, 2 шт.

```MySQL
INSERT INTO products (id, name,	count, price)
VALUES
(8, 'iPhone 7', 1, 59990),
(9, 'iPhone 8', 3, 64990),
(10, 'iPhone X', 2, 79900);
```

# 2.2 Обновление данных

В таблицу **products** внесли данные с ошибкой, вместо iMac в наименовании написали IMAC. Исправьте ошибку.

```MySQL
UPDATE products
SET name='iMac' WHERE name='IMAC';
```

Увеличьте в таблице **users** сотрудникам, у которых зарплата менее 20 000 рублей, зарплату (**salary**) на 10%.

```MySQL
UPDATE users
SET salary = salary * 1.1 WHERE salary < 20000;
```

Проставьте всем заказам без статуса (**status** равен NULL) статус "**new**".

**NULL** – это особое слово в MySQL и в отличии от "cancelled" или "new", его нужно писать без кавычек.
А чтобы сравнить значение в поле с NULL, нужно использовать не символы равенства (=) и неравенства (<>),
а специальное выражение IS NULL или IS NOT NULL.

```MySQL
UPDATE orders
SET orders.status = 'new' WHERE orders.status IS NULL;
```

В поле **amount** в таблице **orders** должно стоять число, которое равно произведению цены (**sum**) на количество (**products_count**). Но из-за сбоя в системе некоторые значения суммы получили 0 или NULL. Обновите таблицу, чтобы в поле amount были правильные значения.

```MySQL
UPDATE orders
SET amount = sum * products_count WHERE amount = 0 OR amount IS NULL;
```

Измените статус (**status**) заказа под номером (**id**) 5 с **delivery** на **success**.

```MySQL
UPDATE orders
SET status = 'success' WHERE id = 5;
```

Увеличьте цену 5 самых дешевых товаров на 5%.

```MySQL
UPDATE products
SET price = price * 1.05
ORDER BY price ASC
LIMIT 5;
```

Уменьшите цену 5 самых дорогих товаров на 5000 рублей.

```MySQL
UPDATE products
SET price = price - 5000
ORDER BY price DESC
LIMIT 5;
```

Ниже находится таблица с товарами в магазине. В поле **count** содержится текущее количество товаров на полках и на складе.

В магазин привезли 2 упаковки Сникерса и 2 упаковки Марса. В каждой упаковке по 20 шоколадок. Обновите данные так, чтобы они отражали количество шоколадок с учетом нового привоза.

```MySQL
UPDATE products
SET count = count + 40
WHERE name = 'Сникерс' OR name = 'Марс';
```

```MySQL
UPDATE products
SET count = count + 2 * 20
WHERE name IN("Сникерс","Марс");
```

```MySQL
UPDATE products
SET count = (CASE id WHEN 3 THEN count + 40 WHEN 5 THEN count + 40 END)
WHERE id IN(3, 5);
```

# 2.3 Удаление данных

Удалите из таблицы **visits** все данные с помощью конструкции **DELETE**.


```MySQL
DELETE from visits;
```

Удалите из таблицы products все товары, которых нет на складе.


```MySQL
DELETE from products
WHERE count = 0;
```

Удалите из таблицы **cars** все автомобили начиная с **2010** года и старше


```MySQL
DELETE from cars
WHERE year <= 2010;
```

Удалите из таблицы **cars** все корейские (country = "KR") автомобили, а также все автомобили мощностью (**power**) меньше 80 лс.
Используйте один SQL-запрос.


```MySQL
DELETE from cars
WHERE country = "KR" OR power < 80;
```

Удалите из таблицы **cars** все японские автомобили мощностью менее 80 и более 130 лс. (включая крайние значения).


```MySQL
DELETE from cars
WHERE country = "JP" AND (power <= 80 OR power >= 130);
```

```MySQL
DELETE FROM cars
WHERE country = 'JP' and power NOT BETWEEN 81 and 129;
```

Удалите из таблицы **cars** все данные с помощью инструкции **TRUNCATE**.


```MySQL
TRUNCATE TABLE cars;
```